; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v2 ?v8)
             (pred_7 ?v11 ?v4)
             (pred_12 ?v2 ?v4)
             (pred_11 ?v9 ?v2 )
	     (pred_3 ?v2)
             (pred_2 ?v12)
             (pred_4 ?v11)
             (pred_9 ?v4)
             (pred_6 ?v2)
             (pred_10 ?v11)
             (pred_1 ?v2)
             (pred_8 ))



(:action op_2
:parameters (?v10 ?v13 ?v3 ?v5)
:precondition (and (pred_2 ?v10) (pred_2 ?v13) (pred_4 ?v3) (pred_9 ?v5)
          (pred_5 ?v10 ?v13) (pred_7 ?v3 ?v5)
                   (pred_12 ?v13 ?v5) (pred_3 ?v10) 
                   (pred_6 ?v13) (pred_10 ?v3))
:effect (and  (pred_1 ?v13) (not (pred_6 ?v13))))


(:action op_5
:parameters (?v10 ?v1)
:precondition (and (pred_2 ?v10) (pred_2 ?v1)
               (pred_3 ?v10) (pred_5 ?v10 ?v1) (pred_1 ?v1))
:effect (and (pred_3 ?v1) (not (pred_3 ?v10))))

(:action op_1
:parameters (?v10 ?v3)
:precondition (and (pred_2 ?v10) (pred_4 ?v3) 
                  (pred_3 ?v10) (pred_11 ?v3 ?v10) (pred_8 ))
:effect (and (pred_10 ?v3)
   (not (pred_11 ?v3 ?v10)) (not (pred_8 ))))


(:action op_4
:parameters (?v10 ?v7 ?v6)
:precondition (and (pred_2 ?v10) (pred_4 ?v7) (pred_4 ?v6)
                  (pred_3 ?v10) (pred_10 ?v6) (pred_11 ?v7 ?v10))
:effect (and (pred_10 ?v7) (pred_11 ?v6 ?v10)
        (not (pred_10 ?v6)) (not (pred_11 ?v7 ?v10))))

(:action op_3
:parameters (?v10 ?v3)
:precondition (and (pred_2 ?v10) (pred_4 ?v3) 
                  (pred_3 ?v10) (pred_10 ?v3))
:effect (and (pred_8 ) (pred_11 ?v3 ?v10) (not (pred_10 ?v3)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_04 obj_19 obj_14 obj_13 obj_18 obj_09 obj_17 obj_12 obj_11 obj_20 obj_06 obj_21 obj_01 obj_10 obj_22
    obj_08 obj_15 obj_05
    obj_07 obj_02 obj_16
    )

    (:init
       (pred_8)

       (pred_2 obj_03)
       (pred_2 obj_04)
       (pred_2 obj_19)
       (pred_2 obj_14)
       (pred_2 obj_13)
       (pred_2 obj_18)
       (pred_2 obj_09)
       (pred_2 obj_17)
       (pred_2 obj_12)
       (pred_2 obj_11)
       (pred_2 obj_20)
       (pred_2 obj_06)
       (pred_2 obj_21)
       (pred_2 obj_01)
       (pred_2 obj_10)
       (pred_2 obj_22)
       (pred_9 obj_08)
       (pred_9 obj_15)
       (pred_9 obj_05)
       (pred_4 obj_07)
       (pred_4 obj_02)
       (pred_4 obj_16)

       (pred_5 obj_03 obj_13)
       (pred_5 obj_03 obj_04)
       (pred_5 obj_04 obj_18)
       (pred_5 obj_04 obj_19)
       (pred_5 obj_04 obj_03)
       (pred_5 obj_19 obj_09)
       (pred_5 obj_19 obj_14)
       (pred_5 obj_19 obj_04)
       (pred_5 obj_14 obj_17)
       (pred_5 obj_14 obj_19)
       (pred_5 obj_13 obj_12)
       (pred_5 obj_13 obj_18)
       (pred_5 obj_13 obj_03)
       (pred_5 obj_18 obj_11)
       (pred_5 obj_18 obj_09)
       (pred_5 obj_18 obj_04)
       (pred_5 obj_18 obj_13)
       (pred_5 obj_09 obj_20)
       (pred_5 obj_09 obj_17)
       (pred_5 obj_09 obj_19)
       (pred_5 obj_09 obj_18)
       (pred_5 obj_17 obj_06)
       (pred_5 obj_17 obj_14)
       (pred_5 obj_17 obj_09)
       (pred_5 obj_12 obj_21)
       (pred_5 obj_12 obj_11)
       (pred_5 obj_12 obj_13)
       (pred_5 obj_11 obj_01)
       (pred_5 obj_11 obj_20)
       (pred_5 obj_11 obj_18)
       (pred_5 obj_11 obj_12)
       (pred_5 obj_20 obj_10)
       (pred_5 obj_20 obj_06)
       (pred_5 obj_20 obj_09)
       (pred_5 obj_20 obj_11)
       (pred_5 obj_06 obj_22)
       (pred_5 obj_06 obj_17)
       (pred_5 obj_06 obj_20)
       (pred_5 obj_21 obj_01)
       (pred_5 obj_21 obj_12)
       (pred_5 obj_01 obj_10)
       (pred_5 obj_01 obj_11)
       (pred_5 obj_01 obj_21)
       (pred_5 obj_10 obj_22)
       (pred_5 obj_10 obj_20)
       (pred_5 obj_10 obj_01)
       (pred_5 obj_22 obj_06)
       (pred_5 obj_22 obj_10)
       (pred_6 obj_09)
       (pred_6 obj_13)
       (pred_6 obj_22)
       (pred_12  obj_09 obj_08)
       (pred_12  obj_13 obj_15)
       (pred_12  obj_22 obj_05)
       (pred_1 obj_03)
       (pred_1 obj_04)
       (pred_1 obj_19)
       (pred_1 obj_14)
       (pred_1 obj_18)
       (pred_1 obj_17)
       (pred_1 obj_12)
       (pred_1 obj_11)
       (pred_1 obj_20)
       (pred_1 obj_06)
       (pred_1 obj_21)
       (pred_1 obj_01)
       (pred_1 obj_10)

       (pred_7  obj_07 obj_08)
       (pred_7  obj_02 obj_15)
       (pred_7  obj_16 obj_05)
       (pred_11 obj_07 obj_21)
       (pred_11 obj_02 obj_11)
       (pred_11 obj_16 obj_01)
       (pred_3 obj_18)
    )

    (:goal (and
       (pred_11 obj_02 obj_17)
    ))
(:constraints
  (always (not (pred_3 obj_20)))
)
)

; plan
1. (op_5 obj_18 obj_11)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_11)
   goals met: 0 of 1
2. (op_1 obj_11 obj_02)
   deleted: (pred_11 obj_02 obj_11) (pred_8)
   added: (pred_10 obj_02)
   goals met: 0 of 1
3. (op_5 obj_11 obj_18)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_18)
   goals met: 0 of 1
4. (op_5 obj_18 obj_04)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_04)
   goals met: 0 of 1
5. (op_5 obj_04 obj_19)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_19)
   goals met: 0 of 1
6. (op_5 obj_19 obj_14)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_14)
   goals met: 0 of 1
7. (op_5 obj_14 obj_17)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_17)
   goals met: 0 of 1
8. (op_3 obj_17 obj_02)
   deleted: (pred_10 obj_02)
   added: (pred_8) (pred_11 obj_02 obj_17)
   goals met: 1 of 1
